public class Primitives {

    byte b = 5; // целые числа от -128 до 127
    short sh = 25545; // целые числа от -32768 до 32767
    int i = 15250000; // целые числа от -2147483648 до 2147483647
    long l = 254000000000L; // целые лисла от -9223372036854775808 до 9223372036854775807
    float f = 2.6f; // тип переменной для хранения чисел с плавающей точкой одинарной точности  (имеет точность 7 знаков после запятой)
    double d = 2.5; // тип переменной для хранения чисел с плавающей точкой двойной точности (имеет точность от 15 до 16 знаков после запятой)
    char ch = 'N'; // символьный тип переменной
    boolean fl = false; // логический тип переменной

    /**
     byte: 0
     short: 0
     int: 0
     long: 0L
     float: 0.0f
     double: 0.0d
     char: ‘\u0000’ (нулевой символ)
     boolean: false
     */

}
